tt2006tt/8266_stm8switAT/code/Gas_准正式版/APP/ESP8826.c
#include "ESP8826.h"
#include "beep.h"
#include "stm8s_gpio.h"

//typedef @far void (*)(void) TFunction;
typedef FAR void (*TFunction)(void);
//BLD start address: change it if your user app is not this one
#define BLD_USER_RESET_ADDR  0x8000ul
//Jump to bootloader(reset) api
const TFunction BldUserApplication = (TFunction)BLD_USER_RESET_ADDR;
const uint8_t hardversion = 0x01;
//extern volatile uint8_t ubBootFlag;
volatile int16_t waitTime = 0;
uint8_t open_key[]      = "Ftl_201207166688";//私钥，用在最开始的注册、登录
uint8_t primaryKey[16] = {0};//除注册和登录，其他的都用私钥
uint8_t cipmode[]       ="AT+CIPMODE=1\r\n";    //透传模式
uint8_t cipsend[]       ="AT+CIPSEND\r\n";      //发送模式
uint8_t endSend[]       ="+++";                 //结束发送
uint8_t Postdata[33] = "action=saveDevid&devid=";


uint8_t DatePackege[DataMax] = {0};

void GetIPv4(char *dst,Typdef_IPAddress *src);//通过这个函数获得掩码并整合到发送数组中
uint8_t UDP_AddrPackege(char *iparr,uint8_t IPNum,uint8_t index);

int strstr_index(char *str,char *sub_str)  //返回子串位置下标
{  
    for(int i = 0; str[i] != '\0'; i++)  
    {  
        int tem = i; //tem保留主串中的起始判断下标位置   
        int j = 0;  
        while(str[i++] == sub_str[j++])  
        {  
            if(sub_str[j] == '\0')  
            {  
                return tem;
            }  
        }  
        i = tem;  
    }  
  
    return 0;  
}  
void RC4(uint8_t* message,char* key,uint8_t msglen)//
{
  
  uint8_t iS[256] ={0};   
  uint16_t i = 0;
//  uint8_t keylen = strlen(key);
  uint8_t keylen = LENGTH_KEY;//(sizeof(key)/sizeof(key[0]))
  uint8_t temp = 0;
  
  uint8_t j = 0;
  uint8_t x = 0;
  
  uint8_t *iInputChar = 0;
  
  uint8_t iOutputChar[DataMax] = {0};
  
  uint8_t t = 0 ;
  
  iInputChar = message;
  
  for ( i = 0; i < 256; i++)
  {
    iS[i] = i;	
  }
  for ( i = 0; i < 256; i++) 
  {		
    j = (j + iS[i] + key[i%keylen]) % 256;
    temp = iS[i];
    iS[i] = iS[j];
    iS[j] = temp;
  }
  for (x = 0,i=0,j=0; x < msglen; x++) 
  {
    i = (i + 1) % 256;
    j = (j + iS[i]) % 256;
    temp = iS[i];
    iS[i] = iS[j];
    iS[j] = temp;
    t = (iS[i] + (iS[j] % 256)) % 256;		
    iOutputChar[x] = (uint8_t) (iInputChar[x] ^ iS[t]);
  }
  
  memset( message,0,msglen);
  memcpy( message,iOutputChar,msglen);
}
uint8_t mystrlen(uint8_t * s){
   uint8_t i;
   for (i = 0; s[i]; i++) ;
   return i;
}
int mystrstr(char *s1,const char *s2){//查找子串

  int n;
  if(*s2){
    while(*s1){
      for( n=0; *(s1+n) == *(s2+n); n++){
        if( !*(s2 + n +1) )
          return 1;
      }
      s1++;
    }
    return 0;
  }
  else
    return 1;
}


void ESP8266_Reload(uint16_t delayTime){	
  ubIndex = 0;
  memset(ubUartRxBuf,0,RXMAX);
  waitTime = delayTime;
}

#ifdef VERSION_2
void ESP8266_GPIO_Init(void){
      //------WRST-------
//    ESP9266_RST_PORT->DDR |= 0X10;
//    ESP9266_RST_PORT->CR1 |= 0X10;
//    ESP9266_RST_PORT->CR2 |= 0X10;
    //-----------------
  GPIO_Init(ESP9266_RST_PORT,(GPIO_Pin_TypeDef)ESP9266_RST_PIN, GPIO_MODE_OUT_PP_HIGH_SLOW);
}

#endif 

void ESP8266_RST(void){
    GPIO_WriteLow(ESP9266_RST_PORT, ESP9266_RST_PIN);//拉低
    DelayApi(25);//拉低50ms
    GPIO_WriteHigh(ESP9266_RST_PORT,ESP9266_RST_PIN);//拉高
}

void ESP8266_Smart(Typdef_ProgramPara *programpara){   
    uint8_t Position = 0;
    uint8_t i                    = 0;
    Typdef_IPAddress IP;
    Typdef_IPAddress NetMask;
    
    uint8_t cipsta[]="AT+CIPSTA?\r\n";
    uint8_t stopsmartstr[]      ="AT+CWSTOPSMART\r\n";
    uint8_t startsmartstr[]     ="AT+CWSTARTSMART\r\n";
    uint8_t SmartACK[18]        ="smartok,";    
    uint8_t close[]             ="AT+CIPCLOSE\r\n";
    uint8_t Connect_Broadcast[]="AT+CIPSTART=\"UDP\",\"255.255.255.255\",18267\r\n";
    switch(programpara->SubMode){
    case SMARTCONFIG_INIT:
                ESP8266_RST();
                DelayApi(500);//等待1秒后开始发送协议 
                
                ESP8266_Reload(200);
                uartSendDataBuf(stopsmartstr,mystrlen(stopsmartstr)); //先停止smart模式  
                programpara->SubMode = SMARTCONFIG_START;//stopsmart模式 
                
                break;                                  
    case SMARTCONFIG_START:
                if(waitTime){//如果还在等待时间内
                  waitTime--;
                  if(mystrstr(ubUartRxBuf,"OK"))//指令执行成功
                  {
                    ESP8266_Reload(200);
                    uartSendDataBuf(startsmartstr,mystrlen(startsmartstr));//发送startsmart指令
                    programpara->SubMode = SMARTCONFIG_WAIT;//进入startsmart指令发送模式
                    break;
                  }
                }
                else
                {
                   programpara->SubMode = SMARTCONFIG_ERROR;//如果超时等待
                }   				
                break;
    case SMARTCONFIG_WAIT: 
                if(waitTime){
                  waitTime--;
                  if(mystrstr(ubUartRxBuf,"OK")){//如果指令执行成功
                    ESP8266_Reload(7000);//等待70s
                    programpara->SubMode = SMARTCONFIG_IP;//进入智能连接等待模式
                    break;
                  }	
                }else{
                  programpara->SubMode = SMARTCONFIG_ERROR;//如果超时等待
                }
                break;
    case SMARTCONFIG_IP: 
                if(waitTime){
                  waitTime--;
                  if(mystrstr(ubUartRxBuf,"GOT IP")|| mystrstr(ubUartRxBuf,"connected wifi")){//如果成功连接  
                    ESP8266_Reload(0);
                    uartSendDataBuf(cipsta,mystrlen(cipsta));//获得掩码

                    DelayApi(500);//等待一秒钟
                    
                    GetIPv4("ip",&IP);//获得IP
                    GetIPv4("netmask",&NetMask);//获得和掩码
                    
                    for(i = 0;i<LENGTH_IPADDR;i++){
                        IP.Arr[i] |= (~NetMask.Arr[i]);//子网掩码取反后与IP相或
                    }
                    
                    Position = 18;
                    for(i = 0;i<LENGTH_IPADDR;i++){
                        Position = UDP_AddrPackege(Connect_Broadcast,IP.Arr[i],Position);
                    }

                    Connect_Broadcast[Position] = '"';
                    Connect_Broadcast[++Position] = ',';
                    Connect_Broadcast[++Position] = '1';
                    Connect_Broadcast[++Position] = '8'; 
                    Connect_Broadcast[++Position] = '2';
                    Connect_Broadcast[++Position] = '6';
                    Connect_Broadcast[++Position] = '7';
                    Connect_Broadcast[++Position] = 0x0d;//  /r
                    Connect_Broadcast[++Position] = 0x0a;//  /n
                    Connect_Broadcast[++Position] = 0;
                    
                    ESP8266_Reload(200);
                    uartSendDataBuf(Connect_Broadcast,mystrlen(Connect_Broadcast));//开始进入广播模式  
                    
