tt2006tt/8266_stm8switAT/code/Gas_准正式版/APP/ESP8826.c
                    programpara->SubMode = SMARTCONFIG_BROAD;
                  }
                }
                else{
                  programpara->SubMode = SMARTCONFIG_ERROR;//如果超时等待
                }
                break;
    case SMARTCONFIG_BROAD:  
                if(waitTime){
                  waitTime--;
                  if(mystrstr(ubUartRxBuf,"OK")){//进入广播模式成功//|| mystrstr(ubUartRxBuf,"ALREADY")
                  
                    ESP8266_Reload(100);
                    uartSendDataBuf(cipmode,mystrlen(cipmode));//设置为透传模式
                    programpara->SubMode = SMARTCONFIG_TRAN;//进入透传模式CIPMODE=1
                    break;
                  }
                }
                else{
                  programpara->SubMode = SMARTCONFIG_ERROR;
                }
                break;
    case SMARTCONFIG_TRAN:  
                if(waitTime){
                  waitTime--;
                  if(mystrstr(ubUartRxBuf,"OK")){//进入透传模式成功
                    uartSendDataBuf(cipsend,mystrlen(cipsend));//进入发送模式
                    programpara->SubMode = SMARTCONFIG_SEND;//开始发送
                  }
                }
                else{
                  programpara->SubMode = SMARTCONFIG_ERROR;
                }
                break;
    case SMARTCONFIG_SEND:
                for(i = 0;i<LENGTH_DEV_ID;i++){
                    SmartACK[i+8] = programpara->Dev_ID[i];
                }//装载数据
                for(i = 0;i<RESENDCNT;i++){//重发10次  防止没收到
                    uartSendDataBuf(SmartACK,18);//发送成功接收指令
                    DelayApi(10);//等待20ms
                }
                DelayApi(10);//等待20ms后发送结束
                uartSendDataBuf(endSend,mystrlen(endSend));//结束发送
                DelayApi(600);//等待1.2s后发送结束
                ESP8266_Reload(100);
                uartSendDataBuf(close,mystrlen(close));//关闭透传
                programpara->SubMode = SMARTCONFIG_FINISH;
    case SMARTCONFIG_FINISH:
                if(waitTime){
                  waitTime--;
                  if(mystrstr(ubUartRxBuf,"OK")){//关闭透传模式成功
                    Mode = Mode_Bias;//进入校正模式*MainMode
                    programpara->SubMode = 0x00;
                    SetBit(programpara->Status,BIT_ONLINE);//成功连接网络
                    SetBit(programpara->Status,BIT_HASNET);//已经连接网络
                  }					
                }else{
                  programpara->SubMode = SMARTCONFIG_ERROR;
                }
                break;             
    default:      //没有正常连上网络
      
                ClrBit(programpara->Status,BIT_ONLINE);//网络连接失败，连接标志位清零
                
                Mode = Mode_Bias;//进入校正模式
                programpara->SubMode = 0x00;//下次进入时从第一步开始
//              LED_BLUE_Ctrl(OFF);//配置失败，蓝灯常暗
//                LED_GREEN_Ctrl(OFF);//配置失败，绿灯常暗
                OFF_All();
                break;
    }
}
void ESP8266Init(Typdef_ProgramPara *programpara){//ESP8266模块初始化，包括复位和连接判断
  uint8_t cipstatus[]="AT+CIPSTATUS\r\n";
 
  switch(programpara->SubMode){ //(*Status)
        case 0x00:    
                    ESP8266_RST();
                    ESP8266_Reload(800);//最久等待8秒
                    programpara->SubMode = 0x01;
        case 0x01:
                    if(waitTime){
                        waitTime--;
                        if(mystrstr(ubUartRxBuf,"GOT IP")){
                            programpara->SubMode  = 0x00;//*Status
                            Mode = Mode_Bias;//进入校正模式
                            SetBit(programpara->Status,BIT_ONLINE);
                            SetBit(programpara->Status,BIT_HASNET);//成功连接网络，打开快闪功能
                            break;
                        }
                    }else{
                        ESP8266_Reload(200);//最久等待2秒
                        uartSendDataBuf(cipstatus,mystrlen(cipstatus));
                        programpara->SubMode = 0x02;
                    }
                    break;
        case 0x02:
                    if(waitTime){
                      waitTime--;
                      if(mystrstr(ubUartRxBuf,"STATUS:2") || mystrstr(ubUartRxBuf,"STATUS:4")){//双重保险
                        programpara->SubMode  = 0x00;//*Status
                        Mode = Mode_Bias;//进入校正模式
                        
			SetBit(programpara->Status,BIT_ONLINE);
			SetBit(programpara->Status,BIT_HASNET);//成功连接网络，打开快闪功能
                        break;
                      }
                    }
                    else{//等待超时
                      Mode = Mode_Config;//如果没有配置成功，则进入配置模式
                      programpara->SubMode = 0x00;//*Status
                    }
                    break;
        default:
                    Mode = Mode_Init;//重头开始
                    programpara->SubMode = 0x00;//*Status
                    break;
  }
  
}

void  ESP8288_WebConnect(Typdef_ProgramPara *programpara)//发送websocket握手协议
{
  uint8_t Web_HandSake[]="GET /SmartHomeServer1/gaws HTTP/1.1\r\nConnection:Upgrade\r\nHost:120.76.210.47:80\r\nOrigin: http://120.76.210.47\r\nSec-WebSocket-Key:Rmx6dHJvbmxpbmswMjcxNg==\r\nSec-WebSocket-Version:13\r\nUpgrade:websocket\r\n\r\n";
  uint8_t Connect_URL[] = "AT+CIPSTART=\"TCP\",\"flytronlink.net\",80\r\n";

  switch(programpara->SubMode){
        case 0x00:
                    ESP8266_Reload(200);
                    uartSendDataBuf(Connect_URL,mystrlen(Connect_URL));
                    programpara->SubMode = 0x01;
                    break;
        case 0x01:
                    if(waitTime){
                      waitTime--;
                      if(mystrstr(ubUartRxBuf,"OK")){//|| mystrstr(ubUartRxBuf,"ALREADY CONNECTED")
                        ESP8266_Reload(200);
                        uartSendDataBuf(cipmode,mystrlen(cipmode));//设置为透传模式												
                        programpara->SubMode = 0x02;//*Status
                        break;
                      }
                    }
                    else{
                      programpara->SubMode  = 0xFF;
                    }
                    break;
        case 0x02:
                    if(waitTime){
                      waitTime--;
                      if(mystrstr(ubUartRxBuf,"OK")){
                        uartSendDataBuf(cipsend,mystrlen(cipsend));//设置为发送模式
                        DelayApi(15);//等待30ms
                        ESP8266_Reload(200);
                        uartSendDataBuf(Web_HandSake,(sizeof(Web_HandSake))/(sizeof(char))-1);
                        programpara->SubMode  = 0x03;
                        break;
                      }
                    }else{
                      programpara->SubMode = 0xFF;
                    }
                    break;
        case 0x03:
                    if(waitTime){
                      waitTime--;
                      if(mystrstr(ubUartRxBuf,"HTTP/1.1 101")){
                        ESP8266_Reload(0);
                        programpara->SubMode = 0x03;
                        Mode = Mode_Nomal;//数据开始传送 		
                        WebSocketOK = 1;//可以进行通信
                        OFF_All();//关掉所有LED和蜂鸣器
                        		


						
