tt2006tt/8266_stm8switAT/code/Gas_准正式版/APP/ESP8826.c
                        if(programpara->Dev_ID[0] == 'G' && programpara->Dev_ID[1] == 'A'){//如果EEPROM中前两字节是GA的话 
                          if(programpara->Dev_ID[2] == 'F'){
                            DataFormat.command = COMMAND_GETNEWID;//还未注册，先注册
                            Receive = 0x01;
                          }
                          else{
                            DataFormat.command = COMMAND_LOGIN;//已注册，进行登录
                            Receive = 0x04;
                          }
                        }else{
                            DataFormat.command = COMMAND_GETNEWID;//还未注册，先注册
                            Receive = 0x01;
                        }
                        
                      }                                             
                    }else{
                      programpara->SubMode = 0xFF;
                    }
                    break;

			
        default:
                    Mode = Mode_Nomal;//正常模式
                    programpara->SubMode = 0x00;
                    DataFormat.command=0x0000;
                    WebSocketOK = 0;//没有成功建立websocket会话         
                    break;  
  }
}

uint8_t WebSocket_Data(void){//websocket 数据打包
  uint8_t sendlen = 0;	
  uint8_t i;
  for(i=0;i<DataMax;i++){
    DatePackege[i] = 0;
  }
  //-----------规定的数据格式头----------
  DatePackege[0] = 0x82; 
  DatePackege[2] = 0x00;
  DatePackege[3] = 0x00;
  DatePackege[4] = 0x00;
  DatePackege[5] = 0x00;
  //--------------------Flag-------------------
  DatePackege[6] = 'F';
  sendlen = 7;
  //--------------------DST_ID-----------------
  memcpy(&DatePackege[sendlen],DataFormat.DST_ID,LENGTH_DST_ID);
  sendlen += LENGTH_DST_ID;//17
  //--------------------SRC_ID-----------------
  
  memcpy(&DatePackege[sendlen],DataFormat.SRC_ID,LENGTH_SRC_ID);
  sendlen += LENGTH_SRC_ID;//27
  //------------------加密类型---------------
  
  memcpy(&DatePackege[sendlen],(uint8_t*)&DataFormat.encrypt,LENGTH_ENCRYPT);
  sendlen += LENGTH_ENCRYPT;//28
  //--------------------包序------------------
  
  DataFormat.idx +=1;
  //DatePackege[sendlen]    = DataFormat.idx>>8;
  //DatePackege[sendlen +1] = DataFormat.idx;
  memcpy(&DatePackege[sendlen],(uint16_t*)&DataFormat.idx,LENGTH_IDX);
  
  sendlen += LENGTH_IDX;//30	
  //-------------命令数据长度--------------
  
  memcpy(&DatePackege[sendlen],(uint16_t*)&DataFormat.payloadlength,LENGTH_PAYLOADLENGTH);
  sendlen += LENGTH_PAYLOADLENGTH;//32
  
  //-------------------命令-------------------
  
  memcpy(&DatePackege[sendlen],(uint16_t*)&DataFormat.command,LENGTH_COMMAND);
  sendlen += LENGTH_COMMAND;//34
  //-------------------数据-------------------	
  memcpy(&DatePackege[sendlen],DataFormat.mems,(DataFormat.payloadlength - 2));
  if(DataFormat.encrypt == 1){
    RC4(&DatePackege[sendlen - LENGTH_COMMAND],open_key,DataFormat.payloadlength);
  }
  else if(DataFormat.encrypt == 2){
    RC4(&DatePackege[sendlen - LENGTH_COMMAND],primaryKey,DataFormat.payloadlength);
  }
  
  sendlen += DataFormat.payloadlength;
  
  DatePackege[1] = 0x80 | (sendlen - 6-2);
  
  return (sendlen - 2);
}

void ProcessPackege(uint8_t *dst,uint8_t *src,uint8_t encrypt,uint16_t length,uint16_t command){
  memcpy(DataFormat.DST_ID,dst,LENGTH_DST_ID);
  memcpy(DataFormat.SRC_ID,src,LENGTH_SRC_ID);
  DataFormat.encrypt = encrypt;
  DataFormat.payloadlength = length;
  DataFormat.command = command;
  
}
void Reflash(uint16_t command,uint8_t receive,uint16_t waittime){
    DataFormat.command = command;
    Receive = receive;
    ESP8266_Reload(waittime);
}
void ESP8266_Monitor(Typdef_ProgramPara *programpara){
  static uint16_t LastTime_Blue;
  static uint16_t LastTime_Red;
  static uint16_t LastTime_Green;//这三个参数决定了对应灯亮的时长
  static uint16_t LastTime_BEEP;//这个参数决定了灯亮的时间 
  static uint8_t  Cnt_Reboot;

  uint8_t length;//要发送的数据包长度
  uint32_t AddrBias = 0x00000000; //地址偏移长度
  uint8_t dst[] = "SSFFFFFFFF";//目标ID
  uint8_t i;
  
  switch(Receive){
    case 0x01:DataFormat.command = COMMAND_GETNEWID;       break;//获得新的设备ID
    case 0x02:DataFormat.command = COMMAND_NEWIDACK;       break;//获得新的设备ID ACK
    case 0x04:DataFormat.command = COMMAND_LOGIN;          break;//Login和在成功建立websocket会话后置位
    case 0x08:DataFormat.command = COMMAND_LOGINACK;       break;//LoginACK
    case 0x10:DataFormat.command = COMMAND_READGAS;        break;//APP读Gas的 PPM值
    case 0x20:DataFormat.command = COMMAND_SETPPM;         break;//设置PPM上限值
    case 0x30:DataFormat.command = COMMAND_LEDCOLOR;       break;//LED测试灯
    case 0x40:DataFormat.command = COMMAND_SELFTEST;       break;//自测
    case 0x50:DataFormat.command = COMMAND_SELFTESTACK;    break;//自测ACK
    case 0xE0:DataFormat.command = COMMAND_UPDATEFIR;      break;//更新固件
    case 0xF0:DataFormat.command = COMMAND_UPDATEFIRACK;   break;//更新固件ACK
    default:break;
  }
    if((programpara->Flag_Test&BIT(BIT_RED))){
      if(abs((int16_t)(programpara->Cnt_Minite - LastTime_Red))>=450){//4.5s
            LED_RED_Ctrl(OFF);
            ClrBit(programpara->Flag_Test,BIT_RED);
        }
    }
    else if((programpara->Flag_Test&BIT(BIT_GREEN))){
        if(abs((int16_t)(programpara->Cnt_Minite - LastTime_Green))>=450){//4.5s
            LED_GREEN_Ctrl(OFF);
            ClrBit(programpara->Flag_Test,BIT_GREEN);
        }    
    }
    else if((programpara->Flag_Test&BIT(BIT_BLUE))){
        if(abs((int16_t)(programpara->Cnt_Minite - LastTime_Blue))>=450){//4.5s
            LED_BLUE_Ctrl(OFF);
            ClrBit(programpara->Flag_Test,BIT_BLUE);
        }
    }
    if((programpara->Flag_Test&BIT(BIT_BEEP))){
        if(abs((int16_t)(programpara->Cnt_Minite - LastTime_BEEP))>=60){//600ms
            GPIO_WriteLow(BEEP_PORT, BEEP_PIN);
            ClrBit(programpara->Flag_Test,BIT_BEEP);
        } 
   }
  if(DataFormat.command != 0X00 && (DataFormat.command != COMMAND_SELFTESTACK && DataFormat.command != COMMAND_WARNING && DataFormat.command != COMMAND_LEDCOLOR)){
        OFF_All();
  }
  switch(DataFormat.command){    
    case COMMAND_READGAS:
                        memcpy(dst,DataFormat.SRC_ID,LENGTH_SRC_ID);
                        ProcessPackege(dst,programpara->Dev_ID,PRIMARYKEY,0x000a,COMMAND_READGASACK);
                        for(i = 0;i<LENGTH_PPM;i++)//装载当前PPM值
                        {
                          DataFormat.mems[3-i] = programpara->PPM>>(8*i); 
                        }          
                        memcpy(&DataFormat.mems[LENGTH_PPM],programpara->Alarm.Arr,LENGTH_PPM);//装载PPM设定值

                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
