tt2006tt/8266_stm8switAT/code/Gas_准正式版/APP/ESP8826.c
                        ClrBit(programpara->Status,BIT_SELFTEST);

                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_WARNING:
                        ProcessPackege(dst,programpara->Dev_ID,PRIMARYKEY,0x0006,COMMAND_WARNING);//目的ID,源ID，加密类型，命令数据长度，命令
                        
                        programpara->SendMEM = 1;
                        
                        for(i = 0;i<LENGTH_PPM;i++){
                          DataFormat.mems[3-i] = programpara->PPM>>(8*i); 
                        }
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_HEARTRATE:
                        ProcessPackege(dst,programpara->Dev_ID,PRIMARYKEY,0x0002,COMMAND_HEARTRATE);
                                 
                        length = WebSocket_Data();
                        DataFormat.command = 0x0000;
                        
                        if(Cnt_Reboot > 2){//如果连续3次没有收到ACK，则程序重启
                            Mode = Mode_Init;
                            WebSocketOK = 0;
                            programpara->Status &= ((1<<BIT_HASBIAS) | (1<<BIT_HASNET));
                            programpara->Status |= ((1<<BIT_HASBIAS) | (1<<BIT_HASNET));
                            programpara->SubMode = 0x00;
                        }
                        Cnt_Reboot++;//重启计数
                        
                        ESP8266_Reload(0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_HEARTRATEACK:
                        
                        Cnt_Reboot = 0;
                        
                        Reflash(0x0000,0xFF,0);
                        
                        break;
    case COMMAND_UPDATEPPM:
                        ProcessPackege(dst,programpara->Dev_ID,PRIMARYKEY,0x0006,COMMAND_UPDATEPPM);
                        
                        for(i = 0;i<4;i++){
                          DataFormat.mems[3-i] = programpara->PPM>>(8*i); 
                        }
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_GETNEWID:          
                        ProcessPackege(dst,programpara->Dev_ID,OPENKEY,0x000c,COMMAND_GETNEWID);
                        
                        memcpy(DataFormat.mems,programpara->Dev_ID,LENGTH_DEV_ID);  
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_NEWIDACK:
                        for(i = 0;i<LENGTH_DEV_ID;i++){

                          programpara->Dev_ID[i] = DataFormat.mems[i];//读服务器发来的数据
                          FLASH_ProgramByte(DEVID_BaseAddress + i,programpara->Dev_ID[i]);
                        } 
                        Reflash(COMMAND_LOGIN,0x04,0);
                        
                        break;
    case COMMAND_LOGIN:
                        ProcessPackege(dst,programpara->Dev_ID,OPENKEY,0x0006,0x220b);
                        
                        programpara->HWVersion.Num = hardversion;
                        memcpy(DataFormat.mems,programpara->HWVersion.Arr,LENGTH_DEVVER); 
                                                
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_LOGINACK:      
                        memcpy(primaryKey,DataFormat.mems,LENGTH_KEY); 
                        SetBit(programpara->Status,BIT_LOGINOK);
                        Reflash(0x0000,0xE0,0);//一开始就检测固件
                        break;
    case COMMAND_SETPPM:  
                        memcpy(dst,DataFormat.SRC_ID,LENGTH_SRC_ID);
                        memcpy(programpara->Alarm.Arr,DataFormat.mems,4);
                        if(programpara->Alarm.Num > PPM_MAX){
                            programpara->Alarm.Num= PPM_MAX;
                        }
                       // else if(programpara->Alarm.Num< PPM_MIN){
                         //   programpara->Alarm.Num= PPM_MIN;
                        //}
                        writeSomeByte(PPM_BaseAddress,programpara->Alarm.Arr,LENGTH_PPM);
                        
                        ProcessPackege(dst,programpara->Dev_ID,PRIMARYKEY,0x0002,COMMAND_SETPPMACK);
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_LEDCOLOR:
                        memcpy(dst,DataFormat.SRC_ID,LENGTH_SRC_ID);
                        if(DataFormat.mems[2] == 0xff){//红
                          if(DataFormat.mems[1] == 0xff){
                            if(DataFormat.mems[0] == 0xff){//蜂鸣器
                                GPIO_WriteHigh(BEEP_PORT, BEEP_PIN);
                                LastTime_BEEP = programpara->Cnt_Minite;
                                SetBit(programpara->Flag_Test,BIT_BEEP);
                            }
                          }else{
                                LED_GREEN_Ctrl(OFF);
                                LED_RED_Ctrl(OFF);
                                LED_BLUE_Ctrl(ON);

                                LastTime_Blue = programpara->Cnt_Minite;
                                programpara->Flag_Test =0;
                                SetBit(programpara->Flag_Test,BIT_BLUE); 
                          }
                        }else{
                            if(DataFormat.mems[1] == 0xff){//绿
                                LED_BLUE_Ctrl(OFF);
                                LED_GREEN_Ctrl(ON);
                                LED_RED_Ctrl(OFF);
                                
