tt2006tt/8266_stm8switAT/code/Gas_准正式版/APP/ESP8826.c
                                LastTime_Green = programpara->Cnt_Minite;
                                programpara->Flag_Test =0;
                                SetBit(programpara->Flag_Test,BIT_GREEN);                                  
                            }else{//蓝
                                LED_GREEN_Ctrl(OFF);
                                LED_RED_Ctrl(ON);
                                LED_BLUE_Ctrl(OFF);
                                
                                LastTime_Red = programpara->Cnt_Minite;
                                programpara->Flag_Test =0;
                                SetBit(programpara->Flag_Test,BIT_RED);                              
                            }
                        }
                        ProcessPackege(dst,programpara->Dev_ID,PRIMARYKEY,0x0002,COMMAND_LEDCOLORACK);
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        ClrBit(programpara->Status,BIT_SELFTEST);
                        programpara->SelfTest = 0;
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_UPDATEFIR: 
                        //还没开始更新，数据包号为0
                        DataFormat.mems[0] = 0;
                        DataFormat.mems[1] = 0;
                        
                        //读保存在Flash中的版本号
                        readSomeByte(VerBaseAddress,programpara->Version.Arr,LENGTH_DEVVER);
                        memcpy(&DataFormat.mems[LENGTH_SOFTNUM],programpara->Version.Arr,LENGTH_DEVVER); 
                        
                        //数据整理
                        ProcessPackege(dst,programpara->Dev_ID,OPENKEY,0x0008,COMMAND_UPDATEFIR);
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_UPDATEFIRACK:
//每次ACK返回的是50Byte的二进制数据，而Gas端发送过去的是UPDATE指令，并附加版本号和数据块号
//                        Softpnum = (uint16_t)(DataFormat.mems[0]<<8 & 0xff00) | (DataFormat.mems[1] & 0xff);//获取数据块号数
                        programpara->Updating = 1;
                        AddrBias = ((uint32_t)Softpnum) * 50;//地址偏移      
                        for(i = 0;i<(DataFormat.payloadlength - 2);i++){//将数据写入备份的Flash中
                            FLASH_Firmware(BACKUP_START_ADDR + AddrBias + i,DataFormat.mems[i]);
                        }
                        
                        //------------------------------------------------------
                        if((DataFormat.payloadlength < (MESMAX + 2)) && Softpnum >100){//如果备份区数据已经填满
                            programpara->Version.Num++;//版本号自增后写入Flash用于下次的更新查询
                            writeSomeByte(VerBaseAddress,programpara->Version.Arr,LENGTH_DEVVER);
                            
                            Softpnum = 0;
                            AddrBias = 0;
                            LED_BLUE_Ctrl(OFF);
                            
                            FLASH_ProgramByte(FLAG_BaseAddress,UPDATE_FLAG);//写入更新标志位
                            
                            //将程序跳转至Bootload
                            asm("LDW X,  SP ");
                            asm("LD  A,  $FF");
                            asm("LD  XL, A  ");
                            asm("LDW SP, X  ");
                            // software reset
                            BldUserApplication();
                        }
                        //------------------------------------------------------
                        
                        memset(DataFormat.mems,0,MESMAX);//接收的数组清空以防数据错乱
                        
                        Softpnum++;//数据块号码自增，告诉服务器发送下一个数据块
                        DataFormat.mems[0] = ((uint8_t)(Softpnum>>8) & 0xFF);
                        DataFormat.mems[1] = (uint8_t)(Softpnum & 0xFF);
                        
                        readSomeByte(VerBaseAddress,programpara->Version.Arr,LENGTH_DEVVER);//从内存中拷贝版本号到数据数组中
                        memcpy(&DataFormat.mems[LENGTH_SOFTNUM],programpara->Version.Arr,LENGTH_DEVVER); 
                        
                        ProcessPackege(dst,programpara->Dev_ID,OPENKEY,0x08,COMMAND_UPDATEFIR);
                        length = WebSocket_Data();
                        
                        Reflash(0x0000,0xFF,0);
                        
                        uartSendDataBuf(DatePackege,length);
                        break;
    case COMMAND_SELFTEST:
                        DataFormat.mems[0] = 0x0000;
                        DataFormat.mems[1] = programpara->SelfTest;
                        SetBit(programpara->Status,BIT_SELFTEST);
                        
                        ProcessPackege(dst,programpara->Dev_ID,OPENKEY,0x04,COMMAND_SELFTEST);
                        length = WebSocket_Data();

                        Receive = 0x50;
                        DataFormat.command = COMMAND_SELFTESTACK;
//                        ESP8266_Reload(0);
                        Reflash(COMMAND_SELFTESTACK,0x50,0);
                        
                        uartSendDataBuf(DatePackege,length);

                        break;
    case COMMAND_STOPALARM:
                        SetBit(programpara->Status,BIT_ALARMOFF);
                        ClrBit(ProgramPara.flag_Time,BIT_MINITE);
                        LED_RED_Ctrl(OFF);
                        GPIO_WriteLow(BEEP_PORT, BEEP_PIN);
                        programpara->Cnt_Minite = 0;
                        Reflash(0x0000,0xFF,0);
                        break;
    default:             
                        break;
    }
}

uint8_t myatoi(uint8_t  *str){
        uint8_t value = 0;
        while(*str>='0' && *str<='9'){
                value *= 10;
                value += *str - '0';
                str++;
        }
        return value;
}
void GetIPv4(char *dst,Typdef_IPAddress *src){//通过这个函数获得IPv4的地址，并将其存入DevAddress中
    uint8_t Arrindex = 0;
    uint8_t i = 0;
    uint8_t cnt = 0;
    uint8_t Dev_IP[4] = {0};
    for(i = strstr_index(ubUartRxBuf,dst);i< RXMAX;i++){//遍历接收数组
    
        if(ubUartRxBuf[i] == 0x22 || ubUartRxBuf[i] == 0x2e){//0x22:"    0x2e: .
        
            cnt++;
            if(cnt > 1 && cnt < 6){
                src->Arr[cnt - 2] = myatoi(Dev_IP);//数组转数字
                Arrindex = 0;
                memset(Dev_IP,0,4);
            }
        }
        if(cnt < 5 && cnt >= 1 ){//第一个是“ ，中间三个   .  最后一个也是” 一共5个标识
        
            if(ubUartRxBuf[i] == 0x22 || ubUartRxBuf[i] == 0x2e)
              continue;
            Dev_IP[Arrindex] = ubUartRxBuf[i];
            Arrindex ++;
        }
        if(cnt >= 6){
            cnt = 0;
            break;
        }
            
    } 
}



uint8_t UDP_AddrPackege(char *iparr,uint8_t IPNum,uint8_t index){//将IP地址数字量打包为字符
    uint8_t bai = IPNum / 100;
    uint8_t shi = IPNum % 100 / 10;
    uint8_t ge  = IPNum % 100 % 10;
    
    if(bai !=0){
        iparr[++index] = bai + '0';
    }
    if(shi == 0){
        if(bai !=0){
            iparr[++index] = '0';
        }
    }else{
        iparr[++index] = shi + '0';
    }
    
    if(ge != 0){
        iparr[++index] = ge + '0';
    }
    else{
        iparr[++index] = '0';
    }
    iparr[++index] = '.';
    return index;
}



